УчетВУправляющихДляГит1/src/Documents/УПЖКХ_УправлениеДоговорамиСПоставщикамиУслуг/УПЖКХ_УправлениеДоговорамиСПоставщикамиУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УПЖКХ_УправлениеДоговорамиСПоставщикамиУслуг</name>
  <registerRecords>InformationRegister.УПЖКХ_ПоставщикиУслуг</registerRecords>
  <registerRecords>InformationRegister.УПЖКХ_Удалить_ДанныеПоПоставщикамУслуг</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.КВП_ВидыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоставщикаУслуг</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВариантПоставкиУслуг</name>
    <comment>Помечен на удаление в 3.0.64.5</comment>
    <type>
      <types>EnumRef.УПЖКХ_ВариантыРасчетовСПоставщикамиУслуг</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Объекты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.КВП_Подъезды</types>
        <types>CatalogRef.КВП_Здания</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОплатаЧерезУК</name>
      <comment>Помечен на удаление в 3.0.64.5</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/УПЖКХ_УправлениеДоговорамиСПоставщикамиУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.Ответственный,
	|	Реквизиты.Организация,
	|	Реквизиты.Комментарий,
	|	Реквизиты.ВидУслуги,
	|	Реквизиты.Поставщик,
	|	Реквизиты.ДоговорПоставщикаУслуг
	|ИЗ
	|	Документ.УПЖКХ_УправлениеДоговорамиСПоставщикамиУслуг КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,Ответственный,Организация,Комментарий,
								|ВидУслуги,Поставщик,ДоговорПоставщикаУслуг");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Объекты.Объект,
	|	Объекты.НомерСтроки
	|ИЗ
	|	Документ.УПЖКХ_УправлениеДоговорамиСПоставщикамиУслуг.Объекты КАК Объекты
	|ГДЕ
	|	Объекты.Ссылка = &Ссылка";
	
	ПараметрыПроведения.Вставить("ТаблицаСведенийДляВзаиморасчетов", Запрос.Выполнить().Выгрузить());
	
	Возврат ПараметрыПроведения;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
